# Personality Analysis for Marketing Campaign

# **Problem Statement**

Customer Personality Analysis is a detailed analysis of a company’s ideal customers. It helps a business to better understand its customers and makes it easier for them to modify products according to the specific needs, behaviors and concerns of different types of customers.

Customer personality analysis helps a business to modify its product based on its target customers from different types of customer segments. For example, instead of spending money to market a new product to every customer in the company’s database, a company can analyze which customer segment is most likely to buy the product and then market the product only on that particular segment.

### **People**

    ID: dfomer's unique identifier
    Year_Birth: dfomer's birth year
    Education: dfomer's education level
    Marital_Status: dfomer's marital status
    Income: dfomer's yearly household income
    Kidhome: Number of children in dfomer's household
    Teenhome: Number of teenagers in dfomer's household
    Dt_dfomer: Date of dfomer's enrollment with the company
    Recency: Number of days since dfomer's last purchase
    Complain: 1 if dfomer complained in the last 2 years, 0 otherwise

**Products**

    MntWines: Amount spent on wine in last 2 years
    MntFruits: Amount spent on fruits in last 2 years
    MntMeatProducts: Amount spent on meat in last 2 years
    MntFishProducts: Amount spent on fish in last 2 years
    MntSweetProducts: Amount spent on sweets in last 2 years
    MntGoldProds: Amount spent on gold in last 2 years

**Promotion**

    NumDealsPurchases: Number of purchases made with a discount
    AcceptedCmp1: 1 if dfomer accepted the offer in the 1st campaign, 0 otherwise
    AcceptedCmp2: 1 if dfomer accepted the offer in the 2nd campaign, 0 otherwise
    AcceptedCmp3: 1 if dfomer accepted the offer in the 3rd campaign, 0 otherwise
    AcceptedCmp4: 1 if dfomer accepted the offer in the 4th campaign, 0 otherwise
    AcceptedCmp5: 1 if dfomer accepted the offer in the 5th campaign, 0 otherwise
    Response: 1 if dfomer accepted the offer in the last campaign, 0 otherwise

**Place**

    NumWebPurchases: Number of purchases made through the company’s web site
    NumCatalogPurchases: Number of purchases made using a catalogue
    NumStorePurchases: Number of purchases made directly in stores
    NumWebVisitsMonth: Number of visits to company’s web site in the last month

## Feature Engineering: Clearning

### (1) Import libraries

In [30]:
import pandas as pd
import numpy as np
from matplotlib import pyplot as plt
import seaborn as sns
import plotly.express as px
from sklearn.preprocessing import PowerTransformer
from sklearn.decomposition import PCA
from sklearn.cluster import KMeans
from sklearn.preprocessing import LabelEncoder
from sklearn.preprocessing import StandardScaler
from sklearn.preprocessing import OneHotEncoder
from yellowbrick.cluster import KElbowVisualizer
from sklearn.cluster import KMeans
from sklearn.metrics import silhouette_score
from plotly.subplots import make_subplots
import plotly.graph_objects as go

/usr/local/lib/python3.7/dist-packages/sklearn/utils/deprecation.py:144: FutureWarning:

The sklearn.metrics.classification module is  deprecated in version 0.22 and will be removed in version 0.24. The corresponding classes / functions should instead be imported from sklearn.metrics. Anything that cannot be imported from sklearn.metrics is now part of the private API.

### (2) Import the CSV file

In [31]:
## importing the csv file
marketingDf = pd.read_csv('./marketing-campaign.csv')

In [32]:
## Reading the csv file
marketingDf.head()

     ID  Year_Birth   Education  ... Z_CostContact  Z_Revenue  Response
0  5524        1957  Graduation  ...             3         11         1
1  2174        1954  Graduation  ...             3         11         0
2  4141        1965  Graduation  ...             3         11         0
3  6182        1984  Graduation  ...             3         11         0
4  5324        1981         PhD  ...             3         11         0

[5 rows x 29 columns]

### (3) Explore data (for example, see what is categorial and numerical)

In [33]:
marketingDf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2240 entries, 0 to 2239
Data columns (total 29 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   ID                   2240 non-null   int64
 1   Year_Birth           2240 non-null   int64
 2   Education            2240 non-null   object
 3   Marital_Status       2240 non-null   object
 4   Income               2216 non-null   float64
 5   Kidhome              2240 non-null   int64
 6   Teenhome             2240 non-null   int64
 7   Dt_Customer          2240 non-null   object
 8   Recency              2240 non-null   int64
 9   MntWines             2240 non-null   int64
 10  MntFruits            2240 non-null   int64
 11  MntMeatProducts      2240 non-null   int64
 12  MntFishProducts      2240 non-null   int64
 13  MntSweetProducts     2240 non-null   int64
 14  MntGoldProds         2240 non-null   int64
 15  NumDealsPurchases    2240 non-null   int64
 16  NumWebPurchases      2240 non-null   int64
 17  NumCatalogPurchases  2240 non-null   int64
 18  NumStorePurchases    2240 non-null   int64
 19  NumWebVisitsMonth    2240 non-null   int64
 20  AcceptedCmp3         2240 non-null   int64
 21  AcceptedCmp4         2240 non-null   int64
 22  AcceptedCmp5         2240 non-null   int64
 23  AcceptedCmp1         2240 non-null   int64
 24  AcceptedCmp2         2240 non-null   int64
 25  Complain             2240 non-null   int64
 26  Z_CostContact        2240 non-null   int64
 27  Z_Revenue            2240 non-null   int64
 28  Response             2240 non-null   int64
dtypes: float64(1), int64(25), object(3)
memory usage: 507.6+ KB

In [34]:
marketingDf.describe()

                 ID   Year_Birth  ...  Z_Revenue     Response
count   2240.000000  2240.000000  ...     2240.0  2240.000000
mean    5592.159821  1968.805804  ...       11.0     0.149107
std     3246.662198    11.984069  ...        0.0     0.356274
min        0.000000  1893.000000  ...       11.0     0.000000
25%     2828.250000  1959.000000  ...       11.0     0.000000
50%     5458.500000  1970.000000  ...       11.0     0.000000
75%     8427.750000  1977.000000  ...       11.0     0.000000
max    11191.000000  1996.000000  ...       11.0     1.000000

[8 rows x 26 columns]

In [35]:
## Checking for number of rows and columns
marketingDf.shape

(2240, 29)

### (4) Feature engineering for data that is
#### (a) relevant 
#### (b) unique
#### (c) correct 
#### (d) not missing

#### Drop data that is not a,b,c, or d

In [36]:
## Filling the null values of Income with the mean of income column
marketingDf['Income'] = marketingDf['Income'].fillna(marketingDf['Income'].mean())

In [37]:
## Checking for unique values in each column
marketingDf.nunique()

ID                     2240
Year_Birth               59
Education                 5
Marital_Status            8
Income                 1975
Kidhome                   3
Teenhome                  3
Dt_Customer             663
Recency                 100
MntWines                776
MntFruits               158
MntMeatProducts         558
MntFishProducts         182
MntSweetProducts        177
MntGoldProds            213
NumDealsPurchases        15
NumWebPurchases          15
NumCatalogPurchases      14
NumStorePurchases        14
NumWebVisitsMonth        16
AcceptedCmp3              2
AcceptedCmp4              2
AcceptedCmp5              2
AcceptedCmp1              2
AcceptedCmp2              2
Complain                  2
Z_CostContact             1
Z_Revenue                 1
Response                  2
dtype: int64

In [38]:
## Dropping irrelevant features
df = marketingDf.drop(columns = ['ID', 'Z_CostContact', 'Z_Revenue'], axis = 1)
df.head()

   Year_Birth   Education Marital_Status  ...  AcceptedCmp2  Complain  Response
0        1957  Graduation         Single  ...             0         0         1
1        1954  Graduation         Single  ...             0         0         0
2        1965  Graduation       Together  ...             0         0         0
3        1984  Graduation       Together  ...             0         0         0
4        1981         PhD        Married  ...             0         0         0

[5 rows x 26 columns]

### Changing values

In [39]:
## name of all columns
df.columns

Index(['Year_Birth', 'Education', 'Marital_Status', 'Income', 'Kidhome',
       'Teenhome', 'Dt_Customer', 'Recency', 'MntWines', 'MntFruits',
       'MntMeatProducts', 'MntFishProducts', 'MntSweetProducts',
       'MntGoldProds', 'NumDealsPurchases', 'NumWebPurchases',
       'NumCatalogPurchases', 'NumStorePurchases', 'NumWebVisitsMonth',
       'AcceptedCmp3', 'AcceptedCmp4', 'AcceptedCmp5', 'AcceptedCmp1',
       'AcceptedCmp2', 'Complain', 'Response'],
      dtype='object')

In [40]:
## Changing marital status
## using map function from dataframe
marital_status = {
    "Single": "non_relationship",
    "Together": "in_relationship",
    "Married": "in_relationship",
    "Divorced": "non_relationship",
    "Widow": "non_relationship",
    "Alone": "non_relationship",
    "Absurd": "non_relationship",
    "YOLO": "non_relationship"
}

In [41]:
## Below command goes through every entry in the notebook and replaces each data with its associated value in the dictionary
df["Marital_Status"] = df["Marital_Status"].map(marital_status)

In [42]:
## Checking if everything is substituted
df["Marital_Status"].value_counts()

in_relationship     1444
non_relationship     796
Name: Marital_Status, dtype: int64

In [43]:
## Similarly for Education
df['Education'].value_counts()

Graduation    1127
PhD            486
Master         370
2n Cycle       203
Basic           54
Name: Education, dtype: int64

In [44]:
## Classifying education into two categories. 
## 1. Undergraduate
## 2. Post Graduate

df['Education'] = df['Education'].replace(['PhD', '2n Cycle', 'Graduation', 'Master'], 'Post Graduate')
df['Education'] = df['Education'].replace(['Basic'], 'Under Graduation')

In [45]:
## Converting from string to datetime 
df['Dt_Customer'] = pd.to_datetime(df['Dt_Customer'])

In [46]:
type(df['Dt_Customer'][0])

pandas._libs.tslibs.timestamps.Timestamp

In [47]:
## Finding the max time
df['Dt_Customer'].max()

Timestamp('2014-12-06 00:00:00')

### Creating more features

In [48]:
## We will assume that all the information was collected on 2014-12-06
## Finding the age of the customer with respect to 2014
## Finding the number of days the person is client
df['Age'] = 2014 - df['Year_Birth']

In [51]:

## Combining kids into 1
df["Kids"] = df['Kidhome'] + df["Teenhome"]
## Through below code, We are finding total monthly purchase of the customers
df['MntTotal'] = df['MntWines'] + df['MntFruits'] + df['MntMeatProducts'] + df['MntFishProducts'] + df['MntSweetProducts'] + df['MntGoldProds']
## We are finding the total number of purchases(Deals, web, catelog and store) the customer made 
df['AllPurchases'] = df['NumDealsPurchases'] + df['NumWebPurchases'] + df['NumCatalogPurchases'] + df['NumStorePurchases']
## Calculating the average the customer spent which would be total spent over total purchase
df['AverageSpent'] = round(df['MntTotal'] / df['AllPurchases'], 2)
## Finding deal purchases
df['DealPurchases'] = round(df['NumDealsPurchases']/df['AllPurchases'], 2)
## Total number of accepted offers
df['TotalAcceptedOffers'] = df['AcceptedCmp1'] + df['AcceptedCmp2'] + df['AcceptedCmp3'] + df['AcceptedCmp4'] + df['AcceptedCmp5'] + df['Response'] 
print( "Customer with most recent non transaction streak is",df['Recency'].min(),"days")  
print ("Customer with longest non transaction streak is",df['Recency'].max(),"days")
df[df['Recency'] <= 7].shape
df[(df['Recency']>7) & (df['Recency'] <= 14 )].shape

Customer with most recent non transaction streak is 0 days
customer with longest non transaction streak is 99 days

### Removing irrelevant features

In [ ]:
df.columns

In [ ]:
## Removing customers who didnt make a purchase
## query is used to evaluate some condition 
df = df.query('AllPurchases != 0')

In [ ]:
irrelevantFeats = ['Kidhome', 'Teenhome', 'MntWines', 'MntFruits',
                   'MntMeatProducts', 'MntFishProducts', 'MntSweetProducts', 'Year_Birth',
                   'MntGoldProds', 'NumDealsPurchases', 'NumWebPurchases','NumCatalogPurchases', 
                   'NumStorePurchases', 'NumWebVisitsMonth', 
                   'AcceptedCmp3','AcceptedCmp4', 'AcceptedCmp5', 
                   'AcceptedCmp1', 'AcceptedCmp2' ]
df.drop(irrelevantFeats, axis=1, inplace=True)
df.head()

In [ ]:
df.columns

In [ ]:
### Move Age column to first position
column_to_move = df.pop("Age")
df.insert(0, "Age", column_to_move)

In [ ]:
df.head()

In [ ]:
# Export to CSV file
df.to_csv('./marketingDf_cleaned.csv', index=False)